### 解题思路
 //注意题中说的是chips里面存储的是位置
        //奇数位置移动到奇数位置代价为0，偶数到偶数也是0
        //那么就可以把所有的数移动到相邻的奇偶位置上，例如奇移动到1偶移动到2，总花费是0
        //接下来有两总情况，一种是把奇移动到偶，一种是把偶移动到奇，所以该题求的就是奇偶数个数的最小值

### 代码

```java
class Solution {
    public int minCostToMoveChips(int[] chips) {
        //注意题中说的是chips里面存储的是位置
        //奇数位置移动到奇数位置代价为0，偶数到偶数也是0
        //那么就可以把所有的数移动到相邻的奇偶位置上，例如奇移动到1偶移动到2，总花费是0
        //接下来有两总情况，一种是把奇移动到偶，一种是把偶移动到奇，所以该题求的就是奇偶数个数的最小值
        int odd=0;
        int even=0;
        for(int c : chips){
            if((c&1)==1){
                odd++;
            }else{
                even++;
            }
        }
        return Math.min(odd,even);
    }
}
```