我们可以假设没有北面的墙壁，无限延长东西两面镜子的长度，则光线会通过东西两面镜子的反射一直往北走，每次增加的纵向距离为 $q$。

当光线走过的纵向距离为p的整数倍时，光线到达某个接收器。现在问题转化为了怎么求纵向距离以及怎么通过这个距离来判断光线最终将到达哪一个接收器。  

通过思考不难发现，光线最终向上走的距离即为 $p$ 和 $q$ 的最小公倍数，设其为 $k$。当 $k$ 是 $p$ 的奇数倍时，光线到达北墙；而当 $k$ 为 $p$ 的偶数倍时，光线到达南墙。

因为题中保证了光线最终会遇到一个接收器，所以光线最终到达南墙必定会遇到接收器 0。若光线最终到达北墙，我们可以通过光线与东西墙接触的次数的奇偶性即 $k\%q$ 来确定光线最终会到达接收器 1 还是 2。

若 $k$ 是 $q$ 的奇数倍，则光线最终会遇到接收器 1，否则会遇到接收器2。  


```Python []
class Solution:
    def mirrorReflection(self, p, q):
        """
        :type p: int
        :type q: int
        :rtype: int
        """
        def gcd(m,n):
            while n != 0:
                m, n = n, m % n
            return m
        
        k = p * q // gcd(p,q)
        t1 = k // p
        t2 = k //q
        if t1 & 1 == 0:
            return 0
        if t2 & 1 == 0:
            return 2
        return 1
```