因本人是在太菜 看了很久才明白…
感觉难点不在费马 在求质因数…
```
/** 费马平方和定理是: 一个非负整数c能够表示为两个整数的平方和 
 *  当且仅当c的所有形如 4k+3 的质因子 的幂次 均为偶数 */
class Solution {
    public boolean judgeSquareSum(int c) {
        for (int i = 2; i <= Math.sqrt(c); i ++) {
        	if (c % i != 0)// 连因数都不是 不考虑
        		continue;
        	int count = 0; //记录幂次
        	
        	/** 求质因子 因为i是从小到大 所以只要满足c被i整除 那么第一个i必然是最小质因子
        	 *  之后所有的i也必然是质数 所有进入费马定理判断的都是质因数
        	 *  绝不会出现i等于非质数的情况(若i为非质数 那么i必有某个因数j 
        	 *  j已经在之前被循环到不能被c整除了 自然i也不可能被c整除 因此在第一个if就被continue掉)*/
        	while (c % i == 0) {
        		count ++;
        		c /= i;
        	}
        	/** 到此 c被拆成当前i的n次方 乘 某个无法被当前i整除的数(但是该数进过不断循环总归会变成别的质数的乘积) */
        	
        	/** 费马平方和定理 */
        	/** 其他形式的无所谓 只有形为4k + 3 且幂次为奇数的过不了 */
        	if (i % 4 == 3 && count % 2 != 0) {
        		return false;
        	} 	
        }
        
        /** 跳出循环 说明i*i>c 又i<c 因此c必然是个1次方 c又不能被所有小于它的质数整除 说明c本身就是质数
         *  (若c是某个质数n次方 那么c肯定肯定要比之前质数的平方要大的 然而现在c小于之前数的平方 说明c必然是一次方) */
        return c % 4 != 3;
    }
}