如果堆中石头的数量 $n$ 不能被 $4$ 整除，那么你*总是*可以赢得 Nim 游戏的胜利。

**推理**

让我们考虑一些小例子。显而易见的是，如果石头堆中只有一块、两块、或是三块石头，那么在你的回合，你就可以把全部石子拿走，从而在游戏中取胜。而如果就像题目描述那样，堆中恰好有四块石头，你就会失败。因为在这种情况下不管你取走多少石头，总会为你的对手留下几块，使得他可以在游戏中打败你。因此，要想获胜，在你的回合中，必须避免石头堆中的石子数为 4 的情况。

同样地，如果有五块、六块、或是七块石头，你可以控制自己拿取的石头数，总是恰好给你的对手留下四块石头，使他输掉这场比赛。但是如果石头堆里有八块石头，你就不可避免地会输掉，因为不管你从一堆石头中挑出一块、两块还是三块，你的对手都可以选择三块、两块或一块，以确保在再一次轮到你的时候，你会面对四块石头。

显然，它以相同的模式不断重复 $n=4,8,12,16,\dots$，基本可以看出是 $4$ 的倍数。

```java [zJbcvcsa-Java]
public boolean canWinNim(int n) {
    return (n % 4 != 0);
}
```


**复杂度分析**

* 时间复杂度：$O(1)$，只进行了一次检查。
* 空间复杂度：$O(1)$，没有使用额外的空间。