这是一道经典题，有很多个不同的解法。

不过要注意一下问题要求，如果数组中全体数都是负数，是否要返回最大的负数值。

huangyu 老师课上讲过，tongyongxin 老师网课上讲过，chengyuelaolao 网课上也讲过。

后续有机会再来好好总结。

解法: 

+ 枚举： 暴力枚举 O(n^3), 优化枚举 O(n^2)。 基于枚举的策略最多也就能达 O(n^2)，若想提高，换其他策略
+ 分治： 分治法， 中间合并的时候要注意，O(n) 复杂度解决横跨中间的最大子数组
+ DP: 来自《剑指offer》， 定义 f[i] 表示 以 nums[i] 为结尾的最大子数组，那么状态转移方程： f[i+1] = max{f[i]+nums[i], nums[i]}, 这样很清晰，不过要使用 f[] 数组额外空间。
计算好 f[i] 后，后续再遍历一遍。当然，也可以把这个遍历过程结合到前面中。并省去 f[] 数组空间，只用一个变量。这时候其实就相当于下面利用问题特性的解。

+ 问题特性（贪心？）：任何和为负的子数组都不可能是某一个解的前缀，因此当和为负，则舍去，重新计算。

+ huangyu 老师曾经说可以判断元素是否变号，然后来解，也许是他没说清楚，或者我听错了。我当时冥思苦想后给出了一个奇怪的解法，但习题本已经丢弃，可能找不到了。也有可能不是这一题，我记错了。

