### 解题思路
从评论中的大佬那里得到的解法：
理解：
假设 
1.序列中暂时只有一个元素，那就为最大子序列和
2.往里面添加一个元素，那么如果第一个元素(也就是其最大子序列和)为负数，那么对于新加入的函数没有用，
    所以这两个元素的最大子序列和为第二个元素
3.再往里面添加一个元素，此时列表中有三个元素，第二个元素表示前两个元素的最大子序列和
    此时，如果第二个元素为负数，那么这三个的最大子序列和为 第三个元素的值，
        如果第二个元素不为负数，那么说明这三个元素的最大子序列和可以为前两个的最大子序列和加上第三个元素
        这三个元素的最大子序列和保存在第三个元素的位置
4.(多推一步) 再往里面加一个元素，这时列表有四个元素，如果第三个元素为负数，则加入第四个元素过后第四个元素         不能和前面三个元素取最大子序列和了（因为负数不能增加增益）。
        如果第三个元素为正数， 那么，第四个元素的加入可以使最大子序列数得到增益

### 代码

```python3
class Solution:
    def maxSubArray(self, nums: List[int]) -> int:
        n = len(nums)
        for i in range(1, len(nums)):
            nums[i]= nums[i] + max(nums[i-1], 0)
        return max(nums)



# [-2,1,-3,4,-1,2,1,-5,4]
# [-2,1,-2,4 ]
# nums[i-1] 为前面所有的相加的最大的和
# 
```