### 解题思路
这题参看了别人的想法：
二位数：
a * 10 + b -> a + b  缩小了： a * 10 + b - a - b = 9*a
三位数：
a * 100 + b * 10 + c -> a + b + c 缩小了： a * 100 + b * 10 + c - a - b - c = 99 * a + 9 * b = 9 * (11 * a + b)
其他位数也可以通过这种方式进行总结。可以有一个想法就是原数变化之后缩小了 9 的倍数关系。
所以可以进一步验证：
100 -> 1            缩小了99
19 -> 1             缩小了18
2345 -> 14 -> 5     缩小了2331
可以观察到都是9的倍数，是不是可以推断出原数就是9的取余了？
跑一下测试用例，然后添加一些特殊情况进行代码的优化即可。

### 代码

```java
class Solution {
    public int addDigits(int num) {
        if(num == 0)    return 0;
        if(num % 9 == 0)    return 9;
        else    return num % 9;
    }
}
```