给出贝祖定理的证明：只需要小学水平即可听懂！！！
贝祖定理：若a,b都为正整数，x,y为整数，那么a,b的线性组合，ax+by可以取到的最小正数是 a,b的最大公约数。

证明：

      1.我们把a,b的最大公约数记为d，那么可以得出a是d的k1倍，b是d的k2倍。那么ax+by=k1xd+k2yd=（k1x+k2y)d，ax+by也是d的整数倍。我们假设ax+by能取到的最小的正数为s的话，那么根据如上所说，s是d的整数倍，所以s≥d。

      2.那我们突然 用a/s，假设a÷s=q......r，那么根据这个除式的定义，余数r需要满足：0≤r<s。余数可以用被除数-除数*商表示：r=a-qs=a-q(ax+by)=a-qxa-qby=(1-qx)a+(-qb)y，发现r也是a,b的线性组合。又因为我们的前提假设s是a,b的最小线性组合出来的正数，所以r只能=0，所以s可以整除a。

      3.同理s可以整除b，所以s是a,b的公约数，注意不一定是最大的。所以s≤d

      4.结合1,3的结论，我们假设的ax+by取到的最小正数s就是a,b的最大公约数d
