看题解没看懂，可能是我太菜了，理解不了

这里推荐下 bilibili 的一个视频，[https://www.bilibili.com/video/av9830088?from=search&seid=5967589139650667616](https://www.bilibili.com/video/av9830088?from=search&seid=5967589139650667616)

附上根据视频写的代码和一些打印的值，帮助理解

```js
function permute (nums) {
  let res = []
  perm(nums, 0, nums.length - 1, res)
  return res
}

// p 全排列的开始位置 q 全排列的结束位置
function perm (arr, p, q, res) {
  if (p === q) {
    console.log('当前已全部排列完', arr)
    res.push([...arr])
  } else {
    for (let i = p; i <= q; i++) {
      console.log(`这是要对 ${arr[p]}(下标 ${p}) - ${arr[q]}(下标 ${q}) 进行全排列, 当前 arr ${arr}`)
      swap(arr, i, p)
      console.log(`交换了 ${arr[i]}(下标 ${i}) 和 ${arr[p]}(下标 ${p}) 的位置, 当前 arr ${arr}`)
      perm(arr, p + 1, q, res)
      console.log(`再次交换 ${arr[i]}(下标 ${i}) 和 ${arr[p]}(下标 ${p}) 的位置, 当前 arr ${arr}`)
      // 这里再次交换是为了保证 arr 的相对一致
      swap(arr, i, p)
    }
  }
}

function swap (arr, p, q) {
  let temp = arr[p]
  arr[p] = arr[q]
  arr[q] = temp
}

// console.log(permute([1, 2, 3, 4]))
```

以 [1, 2, 3, 4] 为例，这里列出部分打印结果：

这是要对 1(下标 0) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 1(下标 0) 和 1(下标 0) 的位置, 当前 arr 1,2,3,4
这是要对 2(下标 1) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 2(下标 1) 和 2(下标 1) 的位置, 当前 arr 1,2,3,4
这是要对 3(下标 2) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 3(下标 2) 和 3(下标 2) 的位置, 当前 arr 1,2,3,4
当前已全部排列完 [ 1, 2, 3, 4 ]
再次交换 3(下标 2) 和 3(下标 2) 的位置, 当前 arr 1,2,3,4
这是要对 3(下标 2) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 3(下标 3) 和 4(下标 2) 的位置, 当前 arr 1,2,4,3
当前已全部排列完 [ 1, 2, 4, 3 ]
再次交换 3(下标 3) 和 4(下标 2) 的位置, 当前 arr 1,2,4,3
再次交换 2(下标 1) 和 2(下标 1) 的位置, 当前 arr 1,2,3,4
这是要对 2(下标 1) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 2(下标 2) 和 3(下标 1) 的位置, 当前 arr 1,3,2,4
这是要对 2(下标 2) - 4(下标 3) 进行全排列, 当前 arr 1,3,2,4
交换了 2(下标 2) 和 2(下标 2) 的位置, 当前 arr 1,3,2,4
当前已全部排列完 [ 1, 3, 2, 4 ]
再次交换 2(下标 2) 和 2(下标 2) 的位置, 当前 arr 1,3,2,4
这是要对 2(下标 2) - 4(下标 3) 进行全排列, 当前 arr 1,3,2,4
交换了 2(下标 3) 和 4(下标 2) 的位置, 当前 arr 1,3,4,2
当前已全部排列完 [ 1, 3, 4, 2 ]
再次交换 2(下标 3) 和 4(下标 2) 的位置, 当前 arr 1,3,4,2
再次交换 2(下标 2) 和 3(下标 1) 的位置, 当前 arr 1,3,2,4
这是要对 2(下标 1) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 2(下标 3) 和 4(下标 1) 的位置, 当前 arr 1,4,3,2
这是要对 3(下标 2) - 2(下标 3) 进行全排列, 当前 arr 1,4,3,2
交换了 3(下标 2) 和 3(下标 2) 的位置, 当前 arr 1,4,3,2
当前已全部排列完 [ 1, 4, 3, 2 ]
再次交换 3(下标 2) 和 3(下标 2) 的位置, 当前 arr 1,4,3,2
这是要对 3(下标 2) - 2(下标 3) 进行全排列, 当前 arr 1,4,3,2
交换了 3(下标 3) 和 2(下标 2) 的位置, 当前 arr 1,4,2,3
当前已全部排列完 [ 1, 4, 2, 3 ]
再次交换 3(下标 3) 和 2(下标 2) 的位置, 当前 arr 1,4,2,3
再次交换 2(下标 3) 和 4(下标 1) 的位置, 当前 arr 1,4,3,2
再次交换 1(下标 0) 和 1(下标 0) 的位置, 当前 arr 1,2,3,4
这是要对 1(下标 0) - 4(下标 3) 进行全排列, 当前 arr 1,2,3,4
交换了 1(下标 1) 和 2(下标 0) 的位置, 当前 arr 2,1,3,4
这是要对 1(下标 1) - 4(下标 3) 进行全排列, 当前 arr 2,1,3,4
交换了 1(下标 1) 和 1(下标 1) 的位置, 当前 arr 2,1,3,4
这是要对 3(下标 2) - 4(下标 3) 进行全排列, 当前 arr 2,1,3,4
交换了 3(下标 2) 和 3(下标 2) 的位置, 当前 arr 2,1,3,4
当前已全部排列完 [ 2, 1, 3, 4 ]
...

希望对各位有所帮助