```
function merge(&$nums1, $m, $nums2, $n)
{
	$nums1_count = count($nums1);
	while ($n > 0) {
		if ($nums1[$m - 1] > $nums2[$n - 1]) {
			list($nums1[$m - 1], $nums1[$nums1_count - 1]) = [$nums1[$nums1_count - 1], $nums1[$m - 1]];
			$nums1_count--;
			$m--;
		} else {
			list($nums2[$n - 1], $nums1[$nums1_count - 1]) = [$nums1[$nums1_count - 1], $nums2[$n - 1]];
			$nums1_count--;
			$n--;
		}
	}
	return $nums1;
}
```
比较 $nums2 和 $nums1(除0外)的元素，因为是排序好的，所以每次取最后一个值比较，大的值和 $nums1 末尾的 0 替换位置，直到 $n 为 0 说明 $nums2 的元素已经全部 替换到 $nums1 中。
例如：
```
$nums1 = [1, 2, 4, 8, 10, 0, 0, 0];
$m = 5;
$nums2 = [2, 5, 9];
$n = 3;
```


**第一次：**
```
$nums1 = [1, 2, 4, 8, 0, 0, 0, 10];
$m = 4;
$nums2 = [2, 5, 9];
$n = 3;
```

**第二次：**
```
$nums1 = [1, 2, 4, 8, 0, 0, 9, 10];
$m = 4;
$nums2 = [2, 5, 0];
$n = 2;
```

**第三次：**
```
$nums1 = [1, 2, 4, 0, 0, 8, 9, 10];
$m = 3;
$nums2 = [2, 5, 0];
$n = 2;
```

**第四次：**
```
$nums1 = [1, 2, 4, 0, 5, 8, 9, 10];
$m = 3;
$nums2 = [2, 0, 0];
$n = 1;
```

**第五次：**
```
$nums1 = [1, 2, 0, 4, 5, 8, 9, 10];
$m = 2;
$nums2 = [2, 0, 0];
$n = 1;
```

**第六次：**
```
$nums1 = [1, 2, 2, 4, 5, 8, 9, 10];
$m = 2;
$nums2 = [0, 0, 0];
$n = 0;
```

**最后得到 $nums1 即结果**