- 执行用时 :0 ms, 在所有 C 提交中击败了100.00%的用户

- 内存消耗 :7.1 MB, 在所有 C 提交中击败了14.59%的用户
```
bool isAnagram(char * s, char * t){
    if (strlen(s) != strlen(t)) return false;
    int i = 0;
    int value[128] = {0,
                      0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0,
                      0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0,
                      0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0,
                      0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0,
                      0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0,
                      0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0,
                      0,0,0,0,0, 0,0};
    while (s[i]) {
        ++value[s[i++]];
    }
    i = 0;
    while (t[i]) {
        --value[t[i++]];
    }
    i = 'a';
    while (i <= 'z') {
        if (value[i++]) return false;
    }
    return true;
}
```