### 1. 题目分析
- 经过少量的推算(或**显然地**)，发现可以将这个数拆成尽量多的某个特定的数，使得结果尽量大
- 假设要拆分的数为$n(n \in \mathbb{N_+})$，特定的数为$x(x \in \mathbb{Z})$，那么可以将$n$分为$\frac{n}{x}$项，记乘积为
$$f(x)={x}^{(\frac{n}{x})}$$
- 本题的本质是求：
$$\max [f(x)], \ \ \forall n\in \mathbb{N_+}  $$
### 2. 数学推导
显然地，
$$f(x)={x}^{(\frac{n}{x})}=e^{\frac{n}{x}\ln x}$$
由于$g(x)=e^x$单调递增，$n>0$恒成立，故
$$h(x)=\frac{1}{x}\ln x$$
与$f(x)$有相同的单调性。注意到<br>
$$h'(x)=\frac{1-\ln x}{x^2}$$
令$h'(x)=0$，得到驻点
$$x_0=e$$
由于$x \lt e$时$y'\gt 0$，$x \gt e$时$y'\lt 0$，故$x_0$为极大值点<br>由于函数连续，只有唯一极大值点，故$x_0$为最大值点
<br>因此，$x=e$时，$f(x)$取最大值：
$$\max f(x)={e}^{\frac{n}{e}}$$
由于$e$不是整数($e=2.71828...$)，故使用与$e$最接近的整数代替之，可以是$2$或$3$
<br>简单比较一下$f(2)$与$f(3)$的大小，即$h(2)$与$h(3)$的大小，考虑到
$$\frac{h(3)}{h(2)}=\frac{2\ln3}{3\ln2}=\frac{\ln9}{\ln8}\gt 1$$
故$h(3)\gt h(2)$，因此$f(3)\gt f(2)$
<br>综上所述，$x=3$
![image.png](https://pic.leetcode-cn.com/e034de2765078ad7cbafaf162a0c6fe995738726ffcf9b49f9bebd1d830c1de2-image.png)

### 3. 结论
- 将数字$n$拆分为尽量多的$3$，可以保证乘积最大。下面简单分类讨论：
  - 若$n \equiv 0(mod \ 3)$，即$n=3k$，则拆分为$k$个$3$
  - 若$n \equiv 1(mod \ 3)$，即$n=3k+1=3(k-1)+2\times 2$，则拆分为$k-1$个$3$，$2$个$2$
  - 若$n \equiv 2(mod \ 3)$，即$n=3k+2$，则拆分为$k$个$3$，$1$个$2$
- 考虑到边界情况，当$n \le 3$时无法拆分，故直接讨论：
  - 若$n=2$，只有$2=1+1$，此时最大值为$1$
  - 若$n=3$，只有$3=1+2$，此时最大值为$2$
  - 以上两种情形可以合并为：当$n \le 3$时，最大值为$n-1$
- 综上所述：
$$\max =
\begin{cases}
n - 1,  & n \le 3 \\
3^k, & n=3k(k\ge2)\\
4\times 3^{k-1}, & n=3k+1(k\ge 1)\\
2 \times 3^k, & n=3k+2(k\ge 1)
\end{cases}$$
### 4. Coding
```
    public int integerBreak(int n) {
    	int p = n % 3, q = n / 3, r = p + (2 * p + 1) % 5;
        return n <= 3 ? n - 1 : (int)(Math.pow(3, q - (p & 1)) * r);
    }
```
时间复杂度：$O(1)$，空间复杂度：$O(1)$
