import "fmt"
```
代码块
``
```
```

func validTicTacToe(board []string) bool {
    //存储井字棋盘
    c := [3][3]string{}
    //存储X和O的个数
    xn := 0
    on := 0
    //存储X和O是否已经获胜
    xflag := false
    oflag := false
   
    //将一维数组的棋局存入二维的数组棋盘
    for i := 0; i < 3;i++{
        s := strings.Split(board[i],"")
        for j := 0; j < 3; j++{
            if s[j] == "X"{
                xn++
            }else if s[j] == "O"{
                on++
            }
            c[i][j] = s[j]
        }
    }
    
    //判断谁赢
    //行列斜
    if (c[0][0] == c[1][1] && c[0][0] == c[2][2] && c[0][0] == "X") ||
    (c[0][2] == c[1][1] && c[0][2] == c[2][0] && c[0][2] == "X") ||
    (c[0][0] == c[0][1] && c[0][0] == c[0][2] && c[0][0] == "X") || 
    (c[1][0] == c[1][1] && c[1][0] == c[1][2] && c[1][0] == "X") || 
    (c[2][0] == c[2][1] && c[2][0] == c[2][2] && c[2][0] == "X") ||
    (c[0][0] == c[1][0] && c[0][0] == c[2][0] && c[0][0] == "X") || 
    (c[0][1] == c[1][1] && c[0][1] == c[2][1] && c[0][1] == "X") || 
    (c[0][2] == c[1][2] && c[0][2] == c[2][2] && c[0][2] == "X"){
        xflag = true
    }
    
    if (c[0][0] == c[1][1] && c[0][0] == c[2][2] && c[0][0] == "O") ||
    (c[0][2] == c[1][1] && c[0][2] == c[2][0] && c[0][2] == "O") ||
    (c[0][0] == c[0][1] && c[0][0] == c[0][2] && c[0][0] == "O") || 
    (c[1][0] == c[1][1] && c[1][0] == c[1][2] && c[1][0] == "O") || 
    (c[2][0] == c[2][1] && c[2][0] == c[2][2] && c[2][0] == "O") ||
    (c[0][0] == c[1][0] && c[0][0] == c[2][0] && c[0][0] == "O") || 
    (c[0][1] == c[1][1] && c[0][1] == c[2][1] && c[0][1] == "O") || 
    (c[0][2] == c[1][2] && c[0][2] == c[2][2] && c[0][2] == "O"){
        oflag = true
    }
    
    //X先下，则O不可能大于X
    //当O等于X时，X不可能赢，O可能赢了；若O没赢的话，下一步由X下
    //当X的子只能大于O一个子，并且X的子大于O的子时，O不能赢
    if on > xn{
        return false
    }else if on == xn{
        if !xflag{
            return true
        }else{
            return false
        }
    }else if xn - on == 1 && !oflag{
        return true
    }else{
        return false
    }

}