### 解题思路
这个题目找的是一串序列里的最大公共前缀，由于是前缀，所以实际上只需要考虑前面的共同部分就可以了，这个是不是很像我们求最大公约数gcd的一个方法？所有字符串都包含这个“最大公约数”（即最长公共前缀），那么是不是只需要一遍跑过去计算这个“最大公约数”就可以了呢？
但是这道题有比较坑的点在于它会给你提供空列表和列表中的空元素，这里就需要进行特判将其删除，这样就可以啦。

**核心代码**
```python3
for i in range(1,n):
    if ans == "":#这里的ans指的是答案，需要进行判断我们这个时候的最长公共前缀是否为空
        return ""
    ans = gcd(ans,strs[i])#gcd实际上就是找最长公共前缀的核心代码
```



### gcd函数的代码

```python3
    def gcd(a,b):#要注意进行特判，有的真的好坑
        if a == "" or b == "":
            return ""
        if a[0] != b[0]:
            return ""
        l, r = 0, min(len(a),len(b))
        while l < r:
            if a[l] != b[l]:
                break
            l += 1
        return a[0:l]
```