### 看图说话
**（x：灯被切换状态， o：灯未被切换状态）**

![图片1.png](https://pic.leetcode-cn.com/86db36a0f0e2f20490592d2907cb36690ec76831de376d4d51a0fafa38649656-%E5%9B%BE%E7%89%871.png)


- 1.观察规律，可知**第i（1<=i<=n）个等共被切换了m次，其中m为i所有因数的个数**（例：2的因数为[1,2],第2个灯被切换了2次；4的因数为[1,2,4],第四个灯被切换了3次）题目要求，最后开着灯灯的个数，因此只有那些因数个数为奇数的灯是开着的

- 2.只有平方数的因数个数为奇数，原因很简单，平方值因数被公用，而非平方数的因数都是成对出现总个数必为偶数（例：9为平方数，因数为[1,3,9]--odd; 8为非平方数，因数为[1,8,2,4]--even）


```python
class Solution:
    # n为平方数的灯为On
    def bulbSwitch(self, n: int) -> int:
        num = 0
        for x in range(1,n+1):
            if x**2 <= n:
                num += 1
            else:
                break
        return num
```