
![image.png](https://pic.leetcode-cn.com/18f624002d984381bcd4ddd59ceeb91d25c1c4cb2c3b6f1ddad46d0d748f4a3a-image.png)

思路：用到了贪心算法，其实贪心算法没有定性，就是一个简单的关于求最优解的思路。
每一道用贪心算法的题都应该找到其中的贪心点，才可以写出来。

关于这题：因为最优解只有一个，既然是最优，那么就往最好的地方去想，今天买的和明天买的差值如果有赚我就今天买明天卖了，不然我就不买不卖。有人会问，那我今天买的明天卖了，万一后天股票价格比我明天卖的更贵那我不是卖早了亏了吗，确实是这样，但是因为是程序，我们有数据我们就可以预知未来，只是一个模拟罢了，并且，因为现实中对股票价格的不可预测性，我们不可能真的乱买乱卖。但是程序有数据能预测我们只是做一个模拟的话是可以求出最优解的。比如 2 4 9，来说，我应该今天买后天卖，最优解为 9 - 2 = 7；那我就不能明天卖，应该后天卖，但是程序它不知道啊，我们这样想，明天卖早了说明我明天买后天在卖还是有钱赚，并且和后天卖的钱挣得是一样的即：4-2 + 9-4 = 7；当然现实中我们不可以这样买卖，只是求最优解的话是可以的。
```
class Solution {
    public int maxProfit(int[] prices) {
        int ans = 0;

        //记录差值
        int Dvalue = 0;
        for(int i = 0; i < prices.length - 1; i++){
            Dvalue = prices[i+1] - prices[i];
            if (Dvalue > 0){
                ans += Dvalue;
            }
        }
         
        return ans;
    }
}
```
