### 解题思路
思路很简单，定义好dp数组之后，其实不论dp(n)还是dp(n-1)他们指代的那个特定元素是不变的，因为这个元素肯定会留到最后幸存。唯独改变的是这个元素所在的数字序号。因为其他元素的删除他们的序号也会改变，所以题目转换成求数字序号改变的状态方程。具体看代码和约瑟夫环的相关内容即可。

### 代码

```python
class Solution(object):
    def lastRemaining(self, n, m):
        """
        :type n: int
        :type m: int
        :rtype: int
        """
        #f(n):当前n个元素不断删除后剩下的最后数字
        #f(n)相对于f(n-1)来说相当于删除了一轮数字，此时新的数字开头为0，相对删除前数字少了m
        #但是f(n)和f(n-1)的结果所在的绝对位置是没有变的，只是数字序号改变了。dp如下
        dp_i_0 = dp_i_1 = 0 #i==1的情况
        i = 2
        while i <= n:
            dp_i_1 = (dp_i_0 + m) % i
            dp_i_0 = dp_i_1
            i += 1            
        return dp_i_1
        
```