起初看这道题的时候是很费解的，也是通过看别人的解题思路才搞懂这个题目的意思
这个题我的方法也很暴力，很简单易懂，仅做参考

# 理解题意
这个题目的例子中包含有隐含的条件

例子1： [[2]] => 在一个1 * 1的方格中叠两块立方体
例子2： [[1,2], [2,3]] => 在一个2 * 2的方格中坐标[0,0]的位置放一个立方体，坐标为[0,1]的位置叠放两个立方体，坐标[1,0]位置叠放2个立方体，坐标[1,1]叠放三个立方体

以此类推

# 解题思路
1. 先看一个位置叠放的立方体，假设该位置叠放了N个立方体，那么他的表面积的公式为：N * 6 - (N - 1) * 2, 该公式很好理解，先算出来所有立方体6个面的面积，然后减去叠在一起被挡住的面积。
2. 然后再看该叠放立方体的上下左右四面自己被遮挡的面积：比如要算上边遮挡住当前立方体的面积时，可以比较两个立方体堆叠的个数，假如上边的个数 >= 当前，则被遮挡的面积为 N * 1；假如当前的 > 上边的个数，则遮挡的面积为上边堆叠的个数 * 1；然后下左右一次类推，可以算出来遮挡的总面积。
3. 最后用当前堆叠的总面积 - 自己被上下左右遮挡的总面积 = 当前立方体的暴露在外的总面积
4. 以此类推
5. 当然其中要考虑边界问题