### 解题思路
本题解采用的是逐个插入的方法，即从B数组中依次取出数组元素，与A数组中的数组元素逐一进行比较，找出元素应该插入的位置（设角标为x），然后将A数组中x到m-1的元素依次后移一位，将B数组元素赋值到A[X]上。
分情况考虑：
1、当待插入元素应插入A数组第一个元素时；
2、当待插入元素应插入A数组最后一个元素时；
3、当待插入元素应插入A数组中间时。
**特殊情况考虑：A数组为一个空数组时，直接将B数组的元素全部赋值到A数组中。（一定要判断，否则编译不通过！！）**

### 代码

```c
void merge(int* A, int ASize, int m, int* B, int BSize, int n)
{
    int i,j,k,l=0;
    for(i=0;i<n;i++)
    {
        if(m==0)
        {
            for(j=0;j<n;j++)
            {
                A[j]=B[j];
            }
        }
        else if(B[i]<A[0])
        {
            for(j=m;j>0;j--)
            {
                A[j]=A[j-1];
            }
            A[0]=B[i];
        }
        else if(B[i]>A[m-1])
        {
            A[m]=B[i];
        }
        else
        {
        for(j=m-1;j>=0;j--)
        {
            if(A[j]<B[i])
            {
                break;
            }
        }
        for(k=m-1;k>j;k--)
        {
            A[k+1]=A[k];
        }
        A[j+1]=B[i];
        }
        m++;
    }
}
```