这个题目的O(1)解法是对9取余数，我们可以通过归纳总结得到，但是无法直观想清楚原理，或者推导公式，这里我用最直观的画图和推导来讲清楚原理。假设有N个石头，我们按照十进制给这N个石头聚堆。
按照十进制聚堆的意思是：1个为1堆，10个为1堆，100个为1堆，也就是10的m次方能聚成1堆
假如石头有123个，那么能聚成几堆？
![屏幕快照 2019-09-04 上午10.42.19.png](https://pic.leetcode-cn.com/b9049d4f45d1d6007203a790b18a57dea5e45075751b35f3e4391e000d71feda-%E5%B1%8F%E5%B9%95%E5%BF%AB%E7%85%A7%202019-09-04%20%E4%B8%8A%E5%8D%8810.42.19.png)
如上图所示，能聚成6堆，其实这就是题目最直观的解法。有k1个(100)堆，百位数就是k1；有k2个(10)堆，十位数就是k2；有k3个(1)堆，个位数就是k3。
堆的个数就是题目要求的各个位上的数之和。设求堆个数的函数为F(N),那么有：
F(123) = (100 - 99) + (10 - 9) + (10 - 9) + 1 + 1 + 1 = 123 - 99x1 -9x2 = 123 - 9x13
也就是每个类别的堆，去掉9或者99，就能得到堆个数，假如是(1000)堆，去掉999就行了，然后把所有加起来，得到结果，那么我们知道有:
F(N) = N - 9xM1
那么问题来了，假如(N - 9xM1)大于10，是不满足要求的，但(N - 9xM1)也是一个数，我们继续可以调用F(N)这个函数：
F(N - 9xM) = N - 9xM1 - 9xM2
按照题目设定，只要是大于10，就继续在得到的结果上操作，则有:
F(N) = F(N - 9xM) = N - 9xM1 -9xM2 = ...
依次类推，直到满足条件:
F(N) = N - 9xM,其中M = (M1+M2+M3+...)；并且结果小于10且大于0，因为堆的个数不可能为0个，这就是对9求余数的的算式，但是稍有变化
当 (N % 9) != 0:
    F(N) = N % 9
当(N % 9) == 0时，N的结果和9是等价的，那么应该是:
    F(N) = F(N - 9xM) = F(9) = 9
    不能是F(N) = F(0)，这样就错了
推导不完全严谨，大家理解意思就行