1. 看到很多题解纠结什么买卖问题，我觉得有点点陷入误区了，真的不用纠结买和卖。

2. 虽然题目说是和买卖股票相关，但是不能被这样的类比所束缚住了。题目本质上是**给出一串数字，求某种最大值**。**这整一串数字是已知的，真实的股市哪里会有知道后面走势的**。**如果真把题目当成股市了，****反倒是容易陷入误区，搞得好像下一个数字是大了还是小了像未知的一样。**

3. 比如[7,1,5,3,6,4]，第一天是7，那是买是卖，**看第二天是涨了还是跌了做决定就好（因为题目都把整串数字都告诉你了，这就像把未来走势都告诉你了一样，真实的股市里肯定不能这样操作，类比股票买卖的话，容易意识不到这一点**）。第二天变成1，跌了，那就可以假设第一天自己没有买。如果第二天是10，那你可以假设自己第一天买了。

4. 说来说去，这道题不是真的买卖股票，本质是“给出一串数字，求某种最大值”

5. 综上可见，在做leetcode的时候一定要本题目本质抽出来，不要因为题目不恰当的类比，限制了自己的思维。

  

附上我的答案：
```
class Solution {
public:
    int maxProfit(vector<int>& prices) {
        int len =prices.size();
        if(len<2)
            return 0;
        int sum=0;
        for(int i=1;i<len;i++){
            int profit=prices[i]-prices[i-1];
            if(profit>0)
                sum+=profit;
        }
        return sum;
        
    }
};
```



