### 解题思路
2020.4.4 tx(面试题)

这一题似乎也有其他很多神奇的方法，例如评论区第一高赞解法以及题解区其他高赞解法。

参考官方题解的数学方法：逐个数位计算，例如对于 “11”，在考虑个位数上的“1”， count += 1. 在考虑十位数上的 “1”， count +=1.
考虑数 xyzw = 1000*x+100*y+10*z+w

+ 首先考虑个位数上的 “1”， 注意到这个是每隔 10 出现一次。 [1, xyz0], 一共有 (xyz)*1个，(xyz0, xyzw] *区间中可能有 0个，也可能有 1 个。 故总共有 (xyzw//10)*1 + I[(xyzw%10)>0]

+ 考虑十位上的 “1”， 注意到每隔100， 十位上出现 “1”， 但是这一出现，对应有 10 个数，因为个位要进10，才能改动十位上的数字。 [1, xy00] 中有 (xyzw//100)*10 个数对应十位为 “1”， (xy00, xyzw] 区间需要细致分析： 若 0<= zw <= 9, 没有；若 zw >= 19, 有 10 个; 若 10<= zw <=18, 有 w+1 个。这里可以先画三段的线，形成分段函数，然后可以写为： min(max(zw-10+1, 0),  10)  
这里示意图如下：
![图片1.png](https://pic.leetcode-cn.com/88f43e7ee049b7f89272145af56004142092076808ad751e00a065f5fc62709b-%E5%9B%BE%E7%89%871.png)

+ 考虑百位上的 “1”， 注意到每隔1000， 白位上出现 “1”， 但是这一出现，对应有 100 个数，因为个位要进 100，才能改动百位上的数字。 [1, x000] 中有 (xyzw//1000)*100 个数对应百位为 “1”， (x000, xyzw] 区间需要细致分析： 若 0<= yzw <= 99, 没有；若 zw >= 199, 有 100 个; 若 99<= zw <=199, 有 zw+1 个。这里可以先画三段的线，然后所有条件可以写为： min(max(zw-100+1, 0),  100)  

+ 后续可以同理考虑。
+ 奇妙的一点，个位上的 “1” 的额外个数： I((xyzw%10)>0) 通过画分段函数，可以等价于： min(w, 1) = min(max(w-1+1, 0),  1)  



### 代码

```python3
class Solution:
    def countDigitOne(self, n: int) -> int:
        if n<=0:
            return 0
        ## 用数学的方法， 逐个计算，个位，十位，百位 等数位上的 "1" 的个数
        count = 0
        k = 1
        while k <= n:
            count += (n//(10*k))*k + min(max(n%(10*k)-k+1, 0), k)  # 对个位也成立
            k *= 10
        return count

```