外行第一次写题解，不是很懂格式。

看到本题第一想法是肯定有数学法解决，但是先写了一手模拟法，果然超时。
又看了约瑟夫环的公式解法后，理解是真的头痛。
但回头想到写模拟法的时候就单独做了只有两个成员时的特殊解。
```
    if(n==2) return m%2;
```
仔细想想这句就是f(2,m)=(0+m)%2嘛，有两个人时找出循环中的幸存者位置。
每删除掉一个数字，视为从删掉的数字下一个位置设定为0，重新开始一次m的循环，数组整体逆时针旋转了m个位置；
旋转后新位置就是f(i,m)-m；反推到上一层就是f(i,m)=(f(i-1)+m)%i，取余找到这一轮所在的位置。
那么就可以从只有一个元素，幸存者位置为0时开始反推到f(n,m)。
```
int lastRemaining(int n, int m){
    int p=0;                    //最后一轮胜者所在下标为0
    for(int i=2;i<=n;i++){      //i相当于每一轮的成员数,循环到最后一轮成员数为n
        p=(p+m)%i;              //i个成员时胜者位置
    }
    return p;
｝
```

