### 解题思路
简单的区间重合问题，只需判断横纵坐标区间上，两矩形有无重合即可。可以自己画图理解！
代码上，即
X轴上：
对比矩形2左下角横坐标是否大于矩形1右上角横坐标，大于等于则必定不重叠；
或者对比矩形1左下角横坐标是否大于矩形2右上角横坐标，大于等于则必定不重叠；
y轴上：
对比矩形2左下角纵坐标是否大于矩形1右上角纵坐标，大于等于则必定不重叠；
或者对比矩形1左下角纵坐标是否大于矩形2右上角纵坐标，大于等于则必定不重叠；
除此四种情况，两矩形在x y轴上的坐标区间必有重叠，即两矩形必定重叠。

### 代码

```cpp
class Solution {
public:
    bool isRectangleOverlap(vector<int>& rec1, vector<int>& rec2) {
        if (rec2[0] >= rec1[2] || rec1[0] >= rec2[2] || rec2[1] >= rec1[3] || rec1[1] >= rec2[3]) return false;
        return true;
    }
};
```