先把返回值n初始为字符串长度，这样就省去判断单个字符为回文串的累加过程。然后对奇数长度回文串和偶数长度回文串分别进行判断：奇数长度回文串以一个字符为中心，在字符串s长度范围内向两端扩展，每扩展一次判断一次，若满足条件则n++；偶数长度回文以两个字符为中心，所以从第二次循环开始判断，用当前字符和前一个字符进行比较，若相等，则可以作为偶数长度回文串中心字符，然后像判断奇数回文一样，在字符串s长度范围内向两端扩展，每扩展一次判断一次，若满足条件则n++。
```
int countSubstrings(char * s){
    int n=strlen(s),m=strlen(s);
    for(int i=0;i<m;i++){
        if(i>0&&s[i]==s[i-1]){
            int p=i-1,q=i;
            while(p>=0&&q<m&&s[p]==s[q]){
                n++;
                p--;
                q++;
            }
        }
        int p=i-1,q=i+1;
        while(p>=0&&q<m&&s[p]==s[q]){
                n++;
                p--;
                q++;
        }
    }
    return n;
}


```
