### 解题思路
这是一道经典的信息论题目
如果一只猪喝下毒之后马上死亡，那么此时有两种状态，不妨标存活为0，死亡为1
将所有的瓶子用二进制数表示，如8个瓶子标为000-111
然后猪1喝下所有二进制数第一位为1的瓶子，猪2喝下所有二进制数第二位为1的瓶子，猪3喝下所有二进制数第三位为1的瓶子
这样，猪的存活状态就能标示哪个瓶子有毒，例如状态为活死死，对应二进制码为011，即为第4个瓶子是毒药。
扩展到这道题 ，猪m分钟内死亡，p分钟内找出有毒水桶，那么，对于每一只猪来说，都能够参加p/m次试验，那么没只猪都有p/m+1种状态，即第一次死了，第二次死了。。。第p/m次死了，没死。
因此我们可以仿照前面的二进制数，将每个瓶子用（n=p/m+1）进制数标记，这样就可以使用最少的猪，猪的数量就是每个瓶子n进制数的位数。位数即为待求值。
该带求值即为log(瓶子数)/log（状态数）
根据香农的信息论，信息熵=连加-（每一项的概率*log(每一项的概率)）。在此活动中每一项都是等概的。
故计算结果：瓶子信息熵=log(瓶子数)，猪信息熵=log(状态数)，为了获得足够的信息需要的猪即为两个信息熵相除

### 代码

```cpp
class Solution {
public:
    int poorPigs(int buckets, int minutesToDie, int minutesToTest) {
int states = minutesToTest / minutesToDie + 1;
        return ceil(log(buckets) / log(states));
    }
};
```